Revit 2027 API
NumericRevisionSettings Constructor
Overload List
Name | Description
NumericRevisionSettings() |  Constructs a NumericRevisionSettings with a simple, default numbering sequence.
NumericRevisionSettings(NumericRevisionSettings) |  Constructs a new copy of the input NumericRevisionSettings object.
NumericRevisionSettings(Int32, String, String) |  Constructs a NumericRevisionSettings object.
Top
See Also
Reference
NumericRevisionSettings Class
Autodesk.Revit.DB Namespace